In [1]:
import pandas as pd
from pandas import Series, DataFrame
notas=pd.Series([9.5,4.7,7.6], index=['P1','P2','P3'])
'P3' in notas

True

In [3]:
d={'SP':2000,'RJ':1800,'ES':700,'MG':1300, 'CE':340,'BA':150} #Number of individuals vaccinated from COVID-19 in thousands of people
states=['BA','SP','MG','PB']
states2=['RJ','CE', 'SP', 'BA']
m=pd.Series(d, index=states)
o=pd.Series(d, index=states2)
m.name='people vaccinated COVID-19'
m.index.name='States'
m.index=['MA','AM','PA', 'AC']

SP    2000
RJ    1800
ES     700
MG    1300
CE     340
BA     150
dtype: int64

In [24]:
data={
  'Fully Vaccinated (Millions)':[2,1.2,0.7,1.5,1.2,1.1,0.7],
     }

frame=DataFrame(data, index=['SP', 'RJ', 'ES', 'MG','RS','PR','FL'],
              )
frame2=DataFrame(data, index=[1,2,3,4,5,6,7]) 
frame2['Population (Millions)']=[31,24.0,23.0,12,11.5,7.5,2]

s=pd.Series([23,42,89], index=[3,2,1])
frame2['Vaccine Ratio (%)']=(frame2['Fully Vaccinated (Millions)'] / frame2['Population (Millions)'])*100
frame.index.name='States'
frame.reindex(['SP', 'RJ', 'ES', 'MG','RS','PR','AM'])

        Fully Vaccinated (Millions)
States
SP                              2.0
RJ                              1.2
ES                              0.7
MG                              1.5
RS                              1.2
PR                              1.1
AM                              NaN

In [145]:
import pandas as pd
from pandas import DataFrame, Series
p=pd.DataFrame()
p['Population']=[17.5,20.0,30.0,21.0]
p['Poverty Rate (%)']=[23,6,32,17]
p['Violence Rates (1:100)']=100
p.index=[1,2,3,4]
p

   Population  Poverty Rate (%)  Violence Rates (1:100)
1        17.5                23                     100
2        20.0                 6                     100
3        30.0                32                     100
4        21.0                17                     100

In [12]:
felipe=pd.Series([1,2,3,4,5,'teste'])
j=pd.DataFrame({'Ameba':[1,2,5,2,5,1,12] })
j['Dados']=['Lua','Caverna','Terra','Sol','Marte','Júpiter', 'Saturno']
j

   Ameba    Dados
0      1      Lua
1      2  Caverna
2      5    Terra
3      2      Sol
4      5    Marte
5      1  Júpiter
6     12  Saturno

In [25]:
felipe=pd.Series([1,2,3,4,5,'teste'])
DataFrame({'alianca':felipe} , index=[0,1,2,3,4])

  alianca
0       1
1       2
2       3
3       4
4       5

In [5]:
import pandas as pd
from pandas import  Series, DataFrame
d={'States':['SP','RJ','MG','ES'],
  'Vaccinated (Millions)':[2.3,1.5,1.7,0.8],
  'Population (Millions)':[20,13.7,11.3,6.5]
  }
s=Series([1,2,4], index=[2,3,4])
frame=DataFrame(d, index=np.arange(1,5))
frame['Vaccine Ratio (%)']=frame['Vaccinated (Millions)']/frame['Population (Millions)']*100
frame['teste']=s
frame['verdade']=frame['States']=='SP'
del frame['verdade']
del frame['teste']
frame['States'] [:2]

1    SP
2    RJ
Name: States, dtype: object

In [19]:
d={'Population':{'São Paulo':34, 'Rio de Janeiro':21, 'Espírito Santo':11},
  'Lixo Produzido':{'São Paulo':21, 'Rio de Janeiro': 10, 'Espírito Santo':21}}
a=DataFrame(d)
o={'Population':a['Population'][:-1],
  'Lixo Produzido':a['Lixo Produzido'][:2]}
'Rio de Janeiro' in a.index

True

In [25]:
a=pd.Index(np.arange(3))
a
#pd.Series([1,2,3], index=a)

Int64Index([0, 1, 2], dtype='int64')

In [80]:
estados=DataFrame(np.arange(9).reshape(3,3),
         index=['a','m','z'], columns=['SP', 'RJ','AM'])
correcao=['SP','RJ', 'RS']
#estados.reindex(['a','d' ,'m','z'], columns=correcao)
estados.reindex(['a','m','z','b'], columns=correcao)

#estados.reindex(columns=correcao)

    SP   RJ  RS
a  0.0  1.0 NaN
m  3.0  4.0 NaN
z  6.0  7.0 NaN
b  NaN  NaN NaN

In [1]:
a=DataFrame({'Vacinados':{'São Paulo':23, 'Rio de Janeiro':12.5, 'Minas Gerais':13.1, 'Amazonas':0.8},
          'População':{'São Paulo':48, 'Rio de Janeiro':37.8, 'Minas Gerais':31.4}})
a.columns.name='Estados'
a

NameError: name 'DataFrame' is not defined

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
a=DataFrame(np.arange(16).reshape(4,4), index=['SP','RJ','ES','MG'],
                                              columns=['one','two','three','four'])
#a[a['one']>5]
a['three']

SP     2
RJ     6
ES    10
MG    14
Name: three, dtype: int64

In [32]:
b=pd.Series(np.arange(5), index=['un', 'dois', 'trois', 'quatre', 'cinq'])
b['dois':'cinq']=900
b

un          0
dois      900
trois     900
quatre    900
cinq      900
dtype: int64

In [23]:
c=pd.DataFrame(np.arange(16).reshape(4,4), 
               index=['SP','RJ','ES','MG'],
               columns=['un','dois', 'trois', 'quatre'])
#c.iloc[:1]
c[:2]

    un  dois  trois  quatre
SP   0     1      2       3
RJ   4     5      6       7

In [8]:
d=pd.DataFrame(np.arange(9).reshape(3,3), index=list('amz')) 
e=pd.DataFrame(np.arange(1,13).reshape(3,4), index=list('bcd'))
#print(d,'\n','\n',e,'\n','\n',d*e)
e.add(d,fill_value=0)

     0     1     2     3
a  0.0   1.0   2.0   NaN
b  1.0   2.0   3.0   4.0
c  5.0   6.0   7.0   8.0
d  9.0  10.0  11.0  12.0
m  3.0   4.0   5.0   NaN
z  6.0   7.0   8.0   NaN

In [31]:
a=pd.DataFrame(np.arange(16).reshape(4,4),
              index=['SP','RJ','ES','MG'],
              columns=[1,2,3,4])
b=a.sub(a[3], axis=0)
print(a,'\n','\n',b)

     1   2   3   4
SP   0   1   2   3
RJ   4   5   6   7
ES   8   9  10  11
MG  12  13  14  15

     1  2  3  4
SP -2 -1  0  1
RJ -2 -1  0  1
ES -2 -1  0  1
MG -2 -1  0  1

In [55]:
a=DataFrame(np.random.randn(4,3),index=['SP','RJ','ES','MG'],
              columns=[1,2,3])
def f(x):
    return pd.Series([x.max(), x.min()] , index=['max', 'min'])
c= lambda x: '%2d' % x

a
#a.applymap(c)

           1         2         3
SP -1.053856  1.244642 -0.595377
RJ -0.863850 -0.155449  0.570633
ES  0.433730  0.390730 -1.559277
MG  0.183424  0.215188  1.151704

In [77]:
probabilidade_chuva=pd.DataFrame(np.random.randn(4,4),
                          index=['RS','SC','PR','SP'],
                                columns=['02/07','03/07','04/07', '05/07'])

f= lambda x: '%.2f' % (np.abs(x)/3)

probabilidade_chuva.applymap(f)

   02/07 03/07 04/07 05/07
RS  0.06  0.25  0.56  0.10
SC  0.03  0.22  0.50  0.38
PR  0.55  0.06  0.07  0.08
SP  0.31  0.23  0.13  0.67

In [2]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
chances_win=pd.DataFrame(np.random.rand(4,4),
                        index=['Hamilton','Verstappen','Perez','LeClerc'],
                        columns=['Monaco','Barcelona','Singapore','Brazil'])

f= lambda x: '%.2f' % np.abs(x)

b=chances_win.applymap(f)
b.sort_index(axis=1, ascending=False)
b.sort_values(by=['Monaco', 'Barcelona'], ascending=False)

           Monaco Barcelona Singapore Brazil
Verstappen   0.62      0.12      0.22   0.30
LeClerc      0.61      0.57      0.33   0.84
Perez        0.54      0.58      0.21   0.74
Hamilton     0.06      0.66      0.73   0.81

In [3]:
obj=pd.Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [38]:
d={'SP':[1,2,3],
   'RJ':[4,9,6]} 
  
a=DataFrame(d, index=[1,2,3])
a.pct_change()
#a.cummax(skipna=True)
#a.idxmax()
#a.columns.is_unique

    SP        RJ
1  NaN       NaN
2  1.0  1.250000
3  0.5 -0.333333

In [5]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import pandas_datareader.data as web
all_data={ticker: web.get_data_yahoo(ticker)
         for ticker in ['AAPL','IBM','MSFT','GOOG','PETR4.SA']}
price=pd.DataFrame({ticker: data['Adj Close']
                   for ticker, data in all_data.items()})
volume=pd.DataFrame({ticker:data['Volume']
                    for ticker, data in all_data.items()}) 
                   

returns=price.pct_change()
price.pct_change()

                AAPL       IBM      MSFT      GOOG  PETR4.SA
Date
2016-07-29       NaN       NaN       NaN       NaN       NaN
2016-08-01  0.017657  0.005167 -0.001764  0.005320 -0.052232
2016-08-02 -0.014804 -0.005388  0.000000 -0.002342  0.009778
2016-08-03  0.012538  0.000560  0.006893  0.002736  0.047535
2016-08-04  0.006178  0.005477  0.007372 -0.002031  0.009244
...              ...       ...       ...       ...       ...
2021-07-22  0.009629 -0.004175  0.016844  0.005490 -0.002225
2021-07-23  0.011989  0.004477  0.012337  0.033657 -0.005948
2021-07-26  0.002895  0.010118 -0.002140  0.013268  0.027300
2021-07-27 -0.014900 -0.000140 -0.008684 -0.020395 -0.011649
2021-07-28 -0.012196 -0.006865 -0.001117 -0.003034  0.020626

[1290 rows x 5 columns]

In [42]:
obj=pd.Series(['manteiga', 'manteiga', 'arroz','arroz','arroz', 'frango', 'atum', 'abóbora'])
unique=pd.Series(['frango','abóbora','atum'] )
pd.value_counts(obj.values, ascending=True)
#pd.Index(unique).get_indexer(obj)
#obj[obj.isin(['abacaxi','arroz'])]

frango      1
atum        1
abóbora     1
manteiga    2
arroz       3
dtype: int64

In [52]:
data= pd.DataFrame({'un':[1,3,4,3,4],
                   'dois':[2,3,1,2,3],
                   'trois':[1,5,2,4,4]})
print(data, '\n','\n', data.apply(pd.value_counts).fillna(0))

   un  dois  trois
0   1     2      1
1   3     3      5
2   4     1      2
3   3     2      4
4   4     3      4

     un  dois  trois
1  1.0   1.0    1.0
2  0.0   2.0    1.0
3  2.0   2.0    0.0
4  2.0   0.0    2.0
5  0.0   0.0    1.0

In [67]:
races={'Monaco':['Hamilton','Hamilton','Rosberg', 'Vettel', 'Bottas'] , 
      'Azerbaijan':['Hamilton','Massa','Vettel','Vettel', 'Bottas'] ,
      'Brazil':['Massa','Massa','Rosberg','Vettel','Hamilton']}

race_drivers=pd.DataFrame(races)
#race_drivers
race_drivers.apply(pd.value_counts).fillna(0)

          Monaco  Azerbaijan  Brazil
Bottas       1.0         1.0     0.0
Hamilton     2.0         1.0     1.0
Massa        0.0         1.0     2.0
Rosberg      1.0         0.0     1.0
Vettel       1.0         2.0     1.0

In [84]:
champions={'Premier League':['Manchester City','Manchester City','Liverpool','Manchester City'],
          'F.A Cup':['Chelsea', 'Manchester City','Arsenal','Leicester'],
          'League Cup':['Manchester City','Manchester City','Manchester City','Manchester City']}
competitions=pd.DataFrame(champions, index=['17/18','18/19','19/20','20/21'])
england_tourneys=competitions.apply(pd.value_counts).fillna(0)
#england_tourneys['Total Titles']=england_tourneys['Premier League']+england_tourneys['F.A Cup']+england_tourneys['League Cup']
england_tourneys['Total Titles']=england_tourneys.iloc[:,0]+england_tourneys.iloc[:,1]+england_tourneys.iloc[:,2]
england_tourneys.astype(int)

                 Premier League  F.A Cup  League Cup  Total Titles
Arsenal                       0        1           0             1
Chelsea                       0        1           0             1
Leicester                     0        1           0             1
Liverpool                     1        0           0             1
Manchester City               3        1           4             8